measurements/wsgi_benchmark_1_ms/worker_results.txt

1 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   146.02ms    1.58ms 151.57ms   97.05%
    Req/Sec     7.65      2.55    30.00     54.10%
  262720 requests in 10.00m, 85.94MB read
Requests/sec:    437.79
Transfer/sec:    146.64KB
latency_values:
{"Min": 3.785, "Max": 151.573, "Avg": 146.018, "Stdev": 1.582}
request_values:
{"Min": 4, "Max": 30, "Avg": 7, "Stdev": 2}
latency_distribution:
{"1%": 145.157, "25%": 145.680, "50%": 145.962, "75%": 146.244, "90%": 146.579, "99%": 148.781, "99.9%": 149.987, "99.99%": 151.199 }
percentiles:
{"percentiles": [ 145.157, 145.227, 145.274, 145.310, 145.341, 145.369, 145.394, 145.418, 145.440, 145.460, 145.480, 145.498, 145.515, 145.532, 145.547, 145.562, 145.577, 145.590, 145.604, 145.617, 145.630, 145.643, 145.655, 145.668, 145.680, 145.693, 145.705, 145.717, 145.729, 145.740, 145.752, 145.764, 145.775, 145.787, 145.798, 145.810, 145.822, 145.833, 145.844, 145.855, 145.865, 145.877, 145.888, 145.898, 145.909, 145.920, 145.931, 145.941, 145.952, 145.962, 145.973, 145.983, 145.994, 146.004, 146.015, 146.025, 146.036, 146.046, 146.057, 146.067, 146.078, 146.088, 146.099, 146.110, 146.121, 146.132, 146.143, 146.154, 146.166, 146.178, 146.190, 146.203, 146.216, 146.229, 146.244, 146.258, 146.273, 146.290, 146.306, 146.323, 146.342, 146.360, 146.380, 146.401, 146.423, 146.447, 146.475, 146.505, 146.539, 146.579, 146.623, 146.675, 146.736, 146.809, 146.908, 147.074, 147.540, 148.192, 148.781, 151.573]}

2 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.62ms  782.34us  87.84ms   97.45%
    Req/Sec    13.75      4.85    30.00     62.37%
  527743 requests in 10.00m, 172.63MB read
Requests/sec:    879.43
Transfer/sec:    294.57KB
latency_values:
{"Min": 4.496, "Max": 87.844, "Avg": 72.618, "Stdev": 0.782}
request_values:
{"Min": 9, "Max": 30, "Avg": 13, "Stdev": 4}
latency_distribution:
{"1%": 71.888, "25%": 72.402, "50%": 72.616, "75%": 72.882, "90%": 73.079, "99%": 73.572, "99.9%": 74.420, "99.99%": 82.035 }
percentiles:
{"percentiles": [ 71.888, 71.996, 72.055, 72.096, 72.128, 72.155, 72.179, 72.199, 72.217, 72.234, 72.249, 72.263, 72.276, 72.288, 72.301, 72.312, 72.323, 72.334, 72.345, 72.355, 72.364, 72.374, 72.384, 72.393, 72.402, 72.411, 72.420, 72.428, 72.436, 72.445, 72.453, 72.461, 72.469, 72.477, 72.486, 72.494, 72.502, 72.510, 72.519, 72.527, 72.536, 72.545, 72.553, 72.562, 72.571, 72.580, 72.588, 72.597, 72.607, 72.616, 72.625, 72.635, 72.644, 72.654, 72.664, 72.674, 72.684, 72.694, 72.705, 72.716, 72.727, 72.737, 72.749, 72.760, 72.771, 72.782, 72.793, 72.804, 72.815, 72.827, 72.838, 72.849, 72.860, 72.871, 72.882, 72.894, 72.905, 72.917, 72.929, 72.940, 72.952, 72.964, 72.977, 72.990, 73.003, 73.018, 73.032, 73.047, 73.063, 73.079, 73.097, 73.116, 73.136, 73.160, 73.188, 73.225, 73.279, 73.372, 73.572, 87.844]}

4 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.35ms  345.38us  48.70ms   86.84%
    Req/Sec    27.42      4.37    60.00     74.31%
  1052017 requests in 10.00m, 344.13MB read
Requests/sec:   1753.07
Transfer/sec:    587.21KB
latency_values:
{"Min": 2.400, "Max": 48.704, "Avg": 36.353, "Stdev": 0.345}
request_values:
{"Min": 19, "Max": 60, "Avg": 27, "Stdev": 4}
latency_distribution:
{"1%": 35.878, "25%": 36.196, "50%": 36.338, "75%": 36.478, "90%": 36.649, "99%": 37.085, "99.9%": 37.646, "99.99%": 40.161 }
percentiles:
{"percentiles": [ 35.878, 35.927, 35.958, 35.982, 36.001, 36.018, 36.032, 36.046, 36.059, 36.071, 36.081, 36.092, 36.102, 36.111, 36.120, 36.129, 36.137, 36.145, 36.153, 36.160, 36.167, 36.175, 36.182, 36.189, 36.196, 36.203, 36.209, 36.216, 36.222, 36.228, 36.234, 36.240, 36.246, 36.252, 36.258, 36.264, 36.269, 36.275, 36.280, 36.286, 36.291, 36.297, 36.302, 36.307, 36.312, 36.317, 36.322, 36.327, 36.333, 36.338, 36.343, 36.348, 36.353, 36.358, 36.363, 36.368, 36.373, 36.378, 36.384, 36.389, 36.394, 36.400, 36.405, 36.410, 36.416, 36.422, 36.427, 36.433, 36.439, 36.445, 36.451, 36.458, 36.464, 36.471, 36.478, 36.485, 36.493, 36.500, 36.509, 36.518, 36.527, 36.537, 36.547, 36.559, 36.571, 36.584, 36.598, 36.614, 36.631, 36.649, 36.670, 36.693, 36.720, 36.752, 36.789, 36.832, 36.887, 36.962, 37.085, 48.704]}

8 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.11ms  273.85us  28.21ms   83.13%
    Req/Sec    54.83      5.01   131.00     51.69%
  2102982 requests in 10.00m, 687.91MB read
Requests/sec:   3504.39
Transfer/sec:      1.15MB
latency_values:
{"Min": 2.200, "Max": 28.209, "Avg": 18.111, "Stdev": 0.274}
request_values:
{"Min": 40, "Max": 131, "Avg": 54, "Stdev": 5}
latency_distribution:
{"1%": 17.479, "25%": 18.020, "50%": 18.125, "75%": 18.232, "90%": 18.345, "99%": 18.615, "99.9%": 19.866, "99.99%": 20.561 }
percentiles:
{"percentiles": [ 17.479, 17.538, 17.579, 17.614, 17.647, 17.681, 17.717, 17.758, 17.806, 17.849, 17.881, 17.904, 17.921, 17.935, 17.946, 17.957, 17.966, 17.974, 17.982, 17.989, 17.996, 18.003, 18.009, 18.014, 18.020, 18.025, 18.030, 18.035, 18.040, 18.045, 18.050, 18.054, 18.058, 18.063, 18.067, 18.071, 18.075, 18.079, 18.083, 18.087, 18.091, 18.095, 18.099, 18.103, 18.107, 18.110, 18.114, 18.118, 18.122, 18.125, 18.129, 18.133, 18.137, 18.141, 18.144, 18.148, 18.152, 18.156, 18.160, 18.164, 18.168, 18.172, 18.176, 18.180, 18.185, 18.189, 18.193, 18.198, 18.202, 18.207, 18.212, 18.217, 18.222, 18.227, 18.232, 18.237, 18.243, 18.248, 18.254, 18.261, 18.267, 18.274, 18.281, 18.288, 18.296, 18.305, 18.314, 18.323, 18.334, 18.345, 18.358, 18.372, 18.387, 18.405, 18.426, 18.451, 18.484, 18.530, 18.615, 28.209]}

16 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.87ms  544.66us  12.04ms   60.93%
    Req/Sec   100.30      4.65   170.00     79.59%
  3834424 requests in 10.00m, 1.22GB read
Requests/sec:   6389.65
Transfer/sec:      2.09MB
latency_values:
{"Min": 2.221, "Max": 12.040, "Avg": 9.868, "Stdev": 0.545}
request_values:
{"Min": 80, "Max": 170, "Avg": 100, "Stdev": 4}
latency_distribution:
{"1%": 8.686, "25%": 9.459, "50%": 9.924, "75%": 10.333, "90%": 10.550, "99%": 10.751, "99.9%": 10.898, "99.99%": 11.096 }
percentiles:
{"percentiles": [ 8.686, 8.766, 8.823, 8.870, 8.913, 8.952, 8.989, 9.023, 9.056, 9.087, 9.117, 9.145, 9.173, 9.199, 9.225, 9.250, 9.275, 9.299, 9.323, 9.347, 9.370, 9.393, 9.415, 9.437, 9.459, 9.480, 9.502, 9.522, 9.543, 9.563, 9.583, 9.603, 9.622, 9.641, 9.660, 9.679, 9.698, 9.716, 9.734, 9.752, 9.770, 9.788, 9.805, 9.822, 9.840, 9.858, 9.875, 9.891, 9.908, 9.924, 9.939, 9.955, 9.971, 9.987, 10.002, 10.018, 10.033, 10.048, 10.063, 10.079, 10.094, 10.110, 10.126, 10.142, 10.159, 10.176, 10.193, 10.210, 10.228, 10.245, 10.263, 10.281, 10.298, 10.316, 10.333, 10.350, 10.366, 10.382, 10.398, 10.413, 10.428, 10.442, 10.456, 10.470, 10.484, 10.497, 10.510, 10.523, 10.536, 10.550, 10.563, 10.577, 10.592, 10.608, 10.625, 10.645, 10.669, 10.701, 10.751, 12.040]}

32 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.07ms  451.70us  18.91ms   85.94%
    Req/Sec   192.46      5.97   313.00     63.92%
  7365217 requests in 10.00m, 2.35GB read
Requests/sec:  12273.31
Transfer/sec:      4.01MB
latency_values:
{"Min": 2.017, "Max": 18.911, "Avg": 5.071, "Stdev": 0.452}
request_values:
{"Min": 140, "Max": 313, "Avg": 192, "Stdev": 5}
latency_distribution:
{"1%": 4.529, "25%": 4.811, "50%": 4.955, "75%": 5.160, "90%": 5.544, "99%": 6.666, "99.9%": 7.972, "99.99%": 9.289 }
percentiles:
{"percentiles": [ 4.529, 4.574, 4.603, 4.624, 4.642, 4.657, 4.670, 4.682, 4.693, 4.703, 4.712, 4.721, 4.730, 4.738, 4.745, 4.753, 4.760, 4.767, 4.774, 4.780, 4.787, 4.793, 4.799, 4.805, 4.811, 4.817, 4.823, 4.828, 4.834, 4.840, 4.846, 4.851, 4.857, 4.862, 4.868, 4.874, 4.879, 4.885, 4.891, 4.896, 4.902, 4.908, 4.913, 4.919, 4.925, 4.931, 4.937, 4.943, 4.949, 4.955, 4.962, 4.968, 4.974, 4.981, 4.987, 4.994, 5.001, 5.008, 5.015, 5.023, 5.030, 5.038, 5.045, 5.053, 5.062, 5.070, 5.079, 5.088, 5.097, 5.106, 5.116, 5.126, 5.137, 5.148, 5.160, 5.172, 5.185, 5.198, 5.213, 5.228, 5.245, 5.263, 5.283, 5.305, 5.329, 5.358, 5.391, 5.431, 5.480, 5.544, 5.627, 5.739, 5.888, 6.034, 6.147, 6.243, 6.340, 6.460, 6.666, 18.911]}

64 workers
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.38ms    2.07ms  22.96ms   63.57%
    Req/Sec   154.12     13.34   272.00     62.92%
  5898501 requests in 10.00m, 1.88GB read
Requests/sec:   9829.26
Transfer/sec:      3.22MB
latency_values:
{"Min": 2.057, "Max": 22.957, "Avg": 6.382, "Stdev": 2.067}
request_values:
{"Min": 100, "Max": 272, "Avg": 154, "Stdev": 13}
latency_distribution:
{"1%": 2.619, "25%": 5.071, "50%": 6.239, "75%": 7.714, "90%": 8.908, "99%": 12.249, "99.9%": 15.348, "99.99%": 16.982 }
percentiles:
{"percentiles": [ 2.619, 2.730, 2.828, 2.929, 3.037, 3.155, 3.283, 3.431, 3.599, 3.770, 3.877, 3.951, 4.009, 4.056, 4.104, 4.155, 4.213, 4.281, 4.366, 4.484, 4.680, 4.863, 4.959, 5.021, 5.071, 5.119, 5.171, 5.226, 5.287, 5.354, 5.434, 5.538, 5.687, 5.844, 5.931, 5.984, 6.022, 6.050, 6.073, 6.092, 6.109, 6.124, 6.139, 6.153, 6.167, 6.181, 6.195, 6.209, 6.224, 6.239, 6.255, 6.272, 6.289, 6.307, 6.326, 6.346, 6.368, 6.392, 6.417, 6.445, 6.476, 6.512, 6.553, 6.601, 6.663, 6.746, 6.849, 6.955, 7.050, 7.135, 7.225, 7.330, 7.452, 7.578, 7.714, 7.832, 7.928, 8.015, 8.101, 8.195, 8.310, 8.447, 8.564, 8.634, 8.683, 8.726, 8.767, 8.810, 8.856, 8.908, 8.970, 9.050, 9.177, 9.458, 9.821, 10.091, 10.499, 11.087, 12.249, 22.957]}